Revit 2023 API
GeometryInstance.Symbol Property
The symbol element that this object is referring to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
[ObsoleteAttribute]
public Element Symbol { get; }
Visual Basic
<ObsoleteAttribute> _
Public ReadOnly Property Symbol As Element
	Get
Visual C++
[ObsoleteAttribute]
public:
property Element^ Symbol {
	Element^ get ();
}
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace